maintaining the readme file
